---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem.GetAirSystemData
source: html/aae8a5b1-1302-fac4-1bb2-799179d3d18e.htm
---
# Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem.GetAirSystemData Method

Returns the air system data, null if not available.

## Syntax (C#)
```csharp
public AirSystemData GetAirSystemData()
```